Revit 2027 API
RibbonItem.ItemType Property
Gets the item type.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RibbonItemType ItemType { get; }
Public ReadOnly Property ItemType As RibbonItemType
	Get
public:
property RibbonItemType ItemType {
	RibbonItemType get ();
}
member ItemType : RibbonItemType with get
Property Value
RibbonItemType
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace